export let QuastionData = [
    {
        quastion: "Какой любимый урок у вас был в школе?", // вопрос
        answer: ["ИЗО", "Математика ", "Обществознание", "Информатика", "Другой"], // варианты ответов
        // total: [6, 3, 2, 1, 0],
        total: [[6], [1, 4, 3], [2, 3], [1, 3], [0]]
    },
    {
        quastion: "К чему больше лежит ваша душа?", // вопрос
        answer: ["Руководить и принимать решения", "Анализировать", "Креативить и придумывать", "Создавать новые приложения"], // варианты ответов
        // total: [2, 4, 6, 1],
        total: [[2], [1, 3, 4], [1, 6], [1]]
    },
    {
        quastion: "Выберите один из предложенных вариантов", // вопрос
        answer: ["Тестировать программы, написанные другими", "Создавать новые алгоритмы", "Руководить разработкой", "Делать дизайн сайта или интерфейса", "Изучать и подбирать методы защиты данных от хакеров", "Собирать компьютеры, объединять их в сети и устанавливать программы"], // варианты ответов
        // total: [4, 1, 2, 6, 5],
        total: [[4], [1], [2], [6], [3], [5]]
    },
    {
        quastion: "Какое утверждение максимально Вам подходит?", // вопрос
        answer: ["Готов очень много работать", "Не получилось – значит не мое ", "Ищу более легкий путь при решении поставленной задачи", "Не успокоюсь, пока не сделаю то что запланировал"], // варианты ответов
        // total: [3, 6, 1, 2],
        total: [[1, 2, 3, 4, 5], [1, 3, 4], [1], [1, 2, 3, 4, 5, 6]]
    },
    // {
    //     quastion: "Вы хотите, чтобы в Вашей ежедневной работе отсутствовали", // вопрос
    //     answer: ["Комплексные и неясные задачи", "Скука, рутина и монотонность", "Правила, стандарты и жесткие рамки", "Частое общение с разными людьми"], // варианты ответов
    //     // total: [5, 4, 3, 2],
    //     total: [[3, 3], [2, 4], [3, 3], [3, 3], [3, 3]]
    // },
    {
        quastion: "Для Вас было предпочтительнее", // вопрос
        answer: ["Работать в условиях постоянного движения, многозадачности, частой смены активности", "Стабильный тип задач, но при этом периодически погружаться во что-то новое", "Спокойная, однообразная и монотонная работа", "Работать на коротких проектах, без долгого цикла сотрудничества"], // варианты ответов
        // total: [2, 1, 4, 6],
        total: [[1, 3], [3], [2, 4, 5], [6]]

    },
    {
        quastion: "Что, на ваш взгляд, важнее всего при создании приложения", // вопрос
        answer: ["Отсутствие багов", "Понятный дизайн", "Качество программного кода", "Приятный интерфейс"], // варианты ответов    
        // total: [1, 2, 4, 6],
        total: [[1, 3], [3], [2, 4, 5], [6]]

    },
    {
        quastion: "Мне больше нравится работать:", // вопрос
        answer: ["В команде, активно взаимодействуя с коллегами", "В команде, периодически взаимодействуя с коллегами, активное общение не люблю.", "Предпочитаю самостоятельную работу, но не против присутствовать на общих встречах", "Команда мне не нужна, прекрасно справляюсь один."], // варианты ответов
        // total: [2, 1, 4, 3],
        total: [[2, 3, 4, 6], [1], [1, 5, 6], [6]]

    },
    {
        quastion: "При изучении нового программного продукта/приложения, я в большей степени обращаю внимание на:", // вопрос
        answer: ["Скорость работы", "Сохранность данных", "Графическое оформление приложений", "Удобство пользования"], // варианты ответов
        // total: [4, 3, 6, 5],
        total: [[1, 4], [3], [6], [5]]

    },
    {
        quastion: "Что для Вас наиболее приоритетно при выборе новой профессии?", // вопрос
        answer: ["Хорошая команда, коллектив", "Зарплата", "Возможность работать удаленно или быстро уйти на фриланс", "Карьерный рост"], // варианты ответов
        // total: [3, 5, 1, 4],
        total: [[1, 2, 3, 5], [1, 4, 3, 5], [1, 6], [1, 2, 3, 4, 5, 6]]

    },
    {
        quastion: "Как Вы оцениваете свой уровень английского языка?", // вопрос
        answer: ["Начальный", "Средний уровень", "Профессиональный", "Вообще не имею понятия"], // варианты ответов
        // total: [5, 4, 2, 0],
        total: [[6], [1, 3, 4, 5], [2], [6]]

    },
    {
        quastion: "Какие технические навыки хотите приобрести?", // вопрос
        answer: ["Визуализировать большие массивы данных", "Создавать 3D-модели и уметь проектировать", "Разрабатывать трудный код", "настройка компьютеров и прикладного ПО"], // варианты ответов
        // total: [1, 6, 3, 5],
        total: [[3], [6], [1], [5]]

    },
    {
        quastion: "Принимая решение о покупке, Вы ориентируетесь на", // вопрос
        answer: ["Многофункциональность", "Визуальное оформление", "Защищенность продукта", "Прочность"], // варианты ответов
        // total: [5, 6, 3, 4],
        total: [[1], [6], [3], [5]]

    },
    {
        quastion: "При принятии решения Вы стараетесь", // вопрос
        answer: ["Установить причинно-следственную связь и максимально оценить последствия своего решения", "Стараюсь обдумывать, но при этом не трачу на это много времени и сил", "Чаще всего принимаю решения, не подумав", ], // варианты ответов
        // total: [3, 1, 5, 6],
        total: [[2, 3], [1, 5, 6], [4]]

    },
    {
        quastion: "Вы умеете быстро", // вопрос
        answer: ["Визуализировать идеи", "Собирать и систематизировать информацию", "Решать поставленные проблемы ", "Разрабатывать алгоритмы действия"], // варианты ответов
        // total: [6, 5, 3, 1],
        total: [[2, 6], [2, 3,], [2, 4], [ 1 ]]
    },
    {
        quastion: "Вы совершили ошибку при выполнении задачи. Ваши действия?", // вопрос
        answer: ["Прогнозирую новый сценарий развития событий", "Начну все заново", "Возвращаюсь к ошибке корень проблемы и стараюсь ее разрешить", "Обсуждаю возникшую проблему и экспертом/коллегам"], // варианты ответов
        // total: [3, 4, 5, 2],
        total: [[4, 2, 6], [0], [1, 2, 3, 4, 5, 6], [ 1 ]]

    },
    {
        quastion: "В процессе обучения вы больше всего любите", // вопрос
        answer: ["Работать с теоретическим материалом и интересными практическими задачами", "Делать что-то нестандартное и творческое", "Дискутировать, анализировать, поднимать проблемы, спорить", "Собирать и настраивать оборудование"], // варианты ответов
        // total: [3, 6, 2, 5],
        total: [[1, 2, 3, 4 ], [1, 3, 6], [2], [ 5 ]]

    },
    // {
    //     quastion: "Что Вас большей степени не устраивает на текущем рабочем месте/профессии?", // вопрос
    //     answer: ["Низкий уровень дохода без возможности серьезного роста в перспективе", "Отсутствие системного подхода к организации дела", "Не гибкий подход к работе", "Отсутствие возможности карьерного роста", "Непрестижность профессии/отрасли"], // варианты ответов
    //     total: [5, 2, 1, 4],
    // },
];

export let Proffesion = [
    {
        name: "Программирование",
        value: '1',
        score: 0,
        numbAct: null
    },
    {
        name: "Управление проектами",
        value: '2',
        score: 0,
        numbAct: null
    },
    {
        name: "Информационная безопасность",
        value: '3',
        score: 0,
        numbAct: null
    },
    {
        name: "Тестировщик",
        value: '4',
        score: 0,
        numbAct: null
    },
    {
        name: "Системное администрирование",
        value:'5',
        score: 0,
        numbAct: null
    },
    {
        name: "Дизайнер",
        value: '6',
        score: 0,
        numbAct: null
    },
]

