import React from 'react'
import Header from '../Header/Header'
import './UserAgreement.css'

const UserAgreement = () => {
  return (
    <>
        <Header />
        <div className="user__agreement container">
            <h1>Пользовательское Соглашение Profitest</h1>
            <p>Настоящее Пользовательское Соглашение (Далее Соглашение) регулирует отношения между владельцем profitest.online (далее Profitest или Администрация) с одной стороны и пользователем сайта с другой.
Сайт Profitest не является средством массовой информации.

Используя сайт, Вы соглашаетесь с условиями данного соглашения.
Если Вы не согласны с условиями данного соглашения, не используйте сайт Profitest!

<br />
<h2>Предмет соглашения</h2>
Администрация предоставляет пользователю право на размещение на сайте следующей информации:

<br />
<h2>Предмет соглашения</h2>
Администрация предоставляет пользователю право на размещение на сайте следующей информации:
- Текстовой информации
- Ссылок на материалы, размещенные на других сайтах

<br />
<h2>Права и обязанности сторон</h2>
Пользователь имеет право:
- осуществлять поиск информации на сайте
- получать информацию на сайте
- копировать информацию на другие сайты с указанием источника
- копировать информацию на другие сайты с разрешения правообладателя
- требовать от администрации скрытия любой информации о пользователе
- требовать от администрации скрытия любой информации переданной пользователем сайту
- использовать информацию сайта в личных некоммерческих целях
<br />
Администрация имеет право:
<ul>
    <li>по своему усмотрению и необходимости создавать, изменять, отменять правила</li>
    <li>ограничивать доступ к любой информации на сайте</li>
    <li>создавать, изменять, удалять информацию</li>
</ul>
<br />
Пользователь обязуется:
<ul>
    <li>обеспечить достоверность предоставляемой информации</li>
    <li>обеспечивать сохранность личных данных от доступа третьих лиц</li>
    <li>обновлять Персональные данные, предоставленные при регистрации, в случае их изменения</li>
    <li>не копировать информацию с других источников</li>
    <li>при копировании информации с других источников, включать в её состав информацию об авторе</li>
    <li>не распространять информацию, которая направлена на пропаганду войны, разжигание национальной, расовой или религиозной ненависти и вражды, а также иной информации, за распространение которой предусмотрена уголовная или административная ответственность</li>
    <li>не нарушать работоспособность сайта</li>
    <li>не создавать несколько учётных записей на Сайте, если фактически они принадлежат одному и тому же лицу</li>
    <li>не совершать действия, направленные на введение других Пользователей в заблуждение</li>
    <li>не передавать в пользование свою учетную запись и/или логин и пароль своей учетной записи третьим лицам</li>
    <li>не регистрировать учетную запись от имени или вместо другого лица за исключением случаев, предусмотренных законодательством РФ</li>
    <li>не размещать материалы рекламного, эротического, порнографического или оскорбительного характера, а также иную информацию, размещение которой запрещено или противоречит нормам действующего законодательства РФ</li>
    <li>не использовать скрипты (программы) для автоматизированного сбора информации и/или взаимодействия с Сайтом и его Сервисами</li>
</ul>
<br />
Администрация обязуется:
<ul>
    <li>поддерживать работоспособность сайта за исключением случаев, когда это невозможно по независящим от Администрации причинам.</li>
    <li>осуществлять разностороннюю защиту учетной записи Пользователя</li>
    <li>защищать информацию, распространение которой ограничено или запрещено законами путем вынесения предупреждения либо удалением учетной записи пользователя, нарушившего правила</li>
    <li>предоставить всю доступную информацию о Пользователе уполномоченным на то органам государственной власти в случаях, установленных законом</li>
</ul>

<br />
Ответственность сторон
<ul>
    <li>пользователь лично несет полную ответственность за распространяемую им информацию</li>
    <li>администрация не несет никакой ответственности за достоверность информации, скопированной из других источников</li>
    <li>администрация не несёт ответственность за несовпадение ожидаемых Пользователем и реально полученных услуг</li>
    <li>администрация не несет никакой ответственности за услуги, предоставляемые третьими лицами</li>
    <li>в случае возникновения форс-мажорной ситуации (боевые действия, чрезвычайное положение, стихийное бедствие и т. д.) Администрация не гарантирует сохранность информации, размещённой Пользователем, а также бесперебойную работу информационного ресурса</li>
</ul>

<br />
<h2>Условия действия Соглашения</h2>
Данное Соглашение вступает в силу при любом использовании данного сайта.
Соглашение перестает действовать при появлении его новой версии.
Администрация оставляет за собой право в одностороннем порядке изменять данное соглашение по своему усмотрению.
Администрация не оповещает пользователей об изменении в Соглашении.
</p>
        </div>
    </>
  )
}

export default UserAgreement